lkolbly/cmsis-svd/data/ADI/ADuCM361.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_INTERRUPT</name>
			<description>Interrupts</description>
			<groupName>INTERRUPT</groupName>
			<baseAddress>0x40002420</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x18</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>EINT0</name>
				<value>1</value>
			</interrupt>
			<interrupt>
				<name>EINT1</name>
				<value>2</value>
			</interrupt>
			<interrupt>
				<name>EINT2</name>
				<value>3</value>
			</interrupt>
			<interrupt>
				<name>EINT3</name>
				<value>4</value>
			</interrupt>
			<interrupt>
				<name>EINT4</name>
				<value>5</value>
			</interrupt>
			<interrupt>
				<name>EINT5</name>
				<value>6</value>
			</interrupt>
			<interrupt>
				<name>EINT6</name>
				<value>7</value>
			</interrupt>
			<interrupt>
				<name>EINT7</name>
				<value>8</value>
			</interrupt>
			<registers>
				<register>
					<name>EI0CFG</name>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<description>External Interrupt configuration register 0</description>
					<fields>
						<field>
							<name>IRQ3EN</name>
							<description>External Interrupt 3 Enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ3MDE</name>
							<description>External Interrupt 0 Mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISE</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ2EN</name>
							<description>External Interrupt 2 Enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ2MDE</name>
							<description>External Interrupt 2 Mode</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISE</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ1EN</name>
							<description>External Interrupt 1 Enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ1MDE</name>
							<description>External Interrupt 1 Mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISE</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ0EN</name>
							<description>External Interrupt 0 Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ0MDE</name>
							<description>External Interrupt 0 Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISE</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EI1CFG</name>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<description>External Interrupt configuration register 1</description>
					<fields>
						<field>
							<name>IRQ7EN</name>
							<description>External Interrupt 7 Enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ7MDE</name>
							<description>External Interrupt 7 Mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISE</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ6EN</name>
							<description>External Interrupt 6 Enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ6MDE</name>
							<description>External Interrupt 6 Mode</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISE</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ5EN</name>
							<description>External Interrupt 5 Enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ5MDE</name>
							<description>External Interrupt 5 Mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISE</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ4EN</name>
							<description>External Interrupt 4 Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ4MDE</name>
							<description>External Interrupt 4 Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISE</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISEORFALL</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHLEVEL</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWLEVEL</name>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EICLR</name>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
					<description>External Interrupts Clear register</description>
					<fields>
						<field>
							<name>IRQ7</name>
							<description>Clears External interrupt 7 internal flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ6</name>
							<description>Clears External interrupt 6 internal flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ5</name>
							<description>Clears External interrupt 5 internal flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ4</name>
							<description>Clears External interrupt 4 internal flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ3</name>
							<description>Clears External interrupt 3 internal flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ2</name>
							<description>Clears External interrupt 2 internal flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ1</name>
							<description>Clears External interrupt 1 internal flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ0</name>
							<description>Clears External interrupt 0 internal flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
