lkolbly/cmsis-svd/data/ADI/ADuCM361.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_FEE</name>
			<description>Flash Controller</description>
			<groupName>FEE</groupName>
			<baseAddress>0x40002800</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x84</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SINC2</name>
				<value>15</value>
			</interrupt>
			<interrupt>
				<name>FLASH</name>
				<value>16</value>
			</interrupt>
			<registers>
				<register>
					<name>FEESTA</name>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<description>Status Register</description>
					<fields>
						<field>
							<name>SIGNERR</name>
							<description>Info space signature check on reset error</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMDRES</name>
							<description>Command result</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SUCCESS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PROTECTED</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VERIFYERR</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ABORT</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WRDONE</name>
							<description>Write Complete</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMDDONE</name>
							<description>Command complete</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WRBUSY</name>
							<description>Write busy</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMDBUSY</name>
							<description>Command busy</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FEECON0</name>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<description>Command Control Register</description>
					<fields>
						<field>
							<name>WREN</name>
							<description>Write enable.</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IENERR</name>
							<description>Error interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IENCMD</name>
							<description>Command complete interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FEECMD</name>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
					<description>Command register</description>
					<fields>
						<field>
							<name>CMD</name>
							<description>Command</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>IDLE</name>
									<value>0</value>
									<description>- No command executed</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>ERASEPAGE</name>
									<value>1</value>
									<description>- Erase Page</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIGN</name>
									<value>2</value>
									<description>- Sign Range</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>MASSERASE</name>
									<value>3</value>
									<description>- Mass Erase User Space</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>ABORT</name>
									<value>4</value>
									<description>- Abort a running command</description>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FEEADR0L</name>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
					<description>Low Page  (Lower 16 bits)</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FEEADR0H</name>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000010</size>
					<description>Low Page  (Upper 16 bits)</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FEEADR1L</name>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000010</size>
					<description>Hi Page  (Lower 16 bits)</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FEEADR1H</name>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000010</size>
					<description>Hi Page  (Upper 16 bits)</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FEEKEY</name>
					<addressOffset>0x00000020</addressOffset>
					<size>0x00000010</size>
					<description>Key</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>USERKEY1</name>
									<value>62550</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USERKEY2</name>
									<value>61731</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FEEPROL</name>
					<addressOffset>0x00000028</addressOffset>
					<size>0x00000010</size>
					<description>Write Protection (Lower 16 bits)</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FEEPROH</name>
					<addressOffset>0x0000002C</addressOffset>
					<size>0x00000010</size>
					<description>Write Protection (Upper 16 bits)</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FEESIGL</name>
					<addressOffset>0x00000030</addressOffset>
					<size>0x00000010</size>
					<description>Signature (Lower 16 bits)</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FEESIGH</name>
					<addressOffset>0x00000034</addressOffset>
					<size>0x00000010</size>
					<description>Signature (Upper 16 bits)</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FEECON1</name>
					<addressOffset>0x00000038</addressOffset>
					<size>0x00000010</size>
					<description>User Setup register</description>
					<fields>
						<field>
							<name>DBG</name>
							<description>Serial Wire debug enable ,</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FEEADRAL</name>
					<addressOffset>0x00000048</addressOffset>
					<size>0x00000010</size>
					<description>Abort address (Lower 16 bits)</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FEEADRAH</name>
					<addressOffset>0x0000004C</addressOffset>
					<size>0x00000010</size>
					<description>Abort address (Upper 16 bits)</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FEEAEN0</name>
					<addressOffset>0x00000078</addressOffset>
					<size>0x00000010</size>
					<description>Lower 16 bits of the sys irq abort enable register.</description>
					<fields>
						<field>
							<name>SINC2</name>
							<description>TBD</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1</name>
							<description>TBD</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T1</name>
							<description>TBD</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T0</name>
							<description>TBD</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3</name>
							<description>TBD</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTINT7</name>
							<description>TBD</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTINT6</name>
							<description>TBD</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTINT5</name>
							<description>TBD</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTINT4</name>
							<description>TBD</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTINT3</name>
							<description>TBD</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTINT2</name>
							<description>TBD</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTINT1</name>
							<description>TBD</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTINT0</name>
							<description>TBD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
