lkolbly/cmsis-svd/data/ADI/ADuCM361.svd
				<register>
					<name>ADC1RCR</name>
					<addressOffset>0x00000028</addressOffset>
					<size>0x00000010</size>
					<description>Number of ADC conversions before an ADC interrupt is generated.</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1RCV</name>
					<addressOffset>0x0000002C</addressOffset>
					<size>0x00000010</size>
					<description>This 16-bit, read-only MMR holds the current number of ADC conversion results</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1TH</name>
					<addressOffset>0x00000030</addressOffset>
					<size>0x00000010</size>
					<description>Sets the threshold</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1THC</name>
					<addressOffset>0x00000034</addressOffset>
					<size>0x00000008</size>
					<description>Determines how many cumulative ADC conversion result readings above ADC1TH must occur</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1THV</name>
					<addressOffset>0x00000038</addressOffset>
					<size>0x00000008</size>
					<description>8-bit threshold exceeded counter register</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1ACC</name>
					<addressOffset>0x0000003C</addressOffset>
					<size>0x00000020</size>
					<description>32-bit accumulator register</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1ATH</name>
					<addressOffset>0x00000040</addressOffset>
					<size>0x00000020</size>
					<description>Holds the threshold value for the accumulator comparator</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1PRO</name>
					<addressOffset>0x00000044</addressOffset>
					<size>0x00000008</size>
					<description>Configuration register for Post processing of ADC results</description>
					<fields>
						<field>
							<name>ACCEN</name>
							<description>ADC Accumulator Enable bits</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>Off</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>En</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EnNDec</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EnAccCnt</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPEN</name>
							<description>ADC Comparator Enable bits</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>Off</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>En</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EnCnt</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EnCntDec</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OREN</name>
							<description>ADC OverRange Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCEN</name>
							<description>ADC Result Counter Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1DAT</name>
					<addressOffset>0x00000048</addressOffset>
					<size>0x00000020</size>
					<description>conversion result register</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_ADCSTEP</name>
			<description>Analog to Digital Converter</description>
			<groupName>ADCSTEP</groupName>
			<baseAddress>0x400300E0</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x10</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DETCON</name>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<description>Control register for reference detection and the step detection filter</description>
					<fields>
						<field>
							<name>REFDET</name>
							<description>Enable external reference detection circuit</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SINC2</name>
							<description>Enable Sinc2 filter</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STEPCTRL</name>
							<description>Control the method to generate the step flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCSEL</name>
							<description>Select ADC</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RATE</name>
							<description>Control the sinc2 filter's time interval</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DETSTA</name>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000008</size>
					<description>Status register for detection</description>
					<fields>
						<field>
							<name>REFSTA</name>
							<description>TBD</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DATOF</name>
							<description>STEPDAT Overflow</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STEPERR</name>
							<description>TBD</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STEPFLAG</name>
							<description>TBD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STEPDATRDY</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STEPTH</name>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
					<description>Threshold for step detection filter</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STEPDAT</name>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000020</size>
					<description>Offers coarse data from the output of the step detection filter</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
