lkolbly/cmsis-svd/data/ADI/ADuCM361.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_ADCDMA</name>
			<description>Analog to Digital Converter</description>
			<groupName>ADCDMA</groupName>
			<baseAddress>0x400300F0</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xC</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ADCDMACON</name>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
					<description>ADC DMA mode Configuration register</description>
					<fields>
						<field>
							<name>SINC2DMAEN</name>
							<description>TBD</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1DMAEN</name>
							<description>TBD</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1CTRL</name>
							<description>TBD</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_DAC</name>
			<description>Digital To Analog Converter</description>
			<groupName>DAC</groupName>
			<baseAddress>0x40020000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x5C</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DACCON</name>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<description>Control Register</description>
					<fields>
						<field>
							<name>DMAEN</name>
							<description>bits</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>Off</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>On</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PD</name>
							<description>TBD</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NPN</name>
							<description>TBD</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUFBYP</name>
							<description>TBD</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLK</name>
							<description>bits</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>HCLK</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Timer1</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLR</name>
							<description>bits</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>Off</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>On</name>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MDE</name>
							<description>Mode bits</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>12bit</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16BitSlow</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16BitFast</name>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RNG</name>
							<description>DAC Range bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>IntVref</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AVdd</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DACDAT</name>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000020</size>
					<description>Data Register</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Data</description>
							<bitOffset>12</bitOffset>
							<bitWidth>20</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	</peripherals>
</device>
